In [1]:
import numpy as np
import pandas as pd

Pivot Tables

In [2]:
data = {
    'date' : pd.date_range('2023-01-01', periods=20, freq='D'),
    'product' : ['A', 'B', 'C', 'D', 'E'] * 4,
    'Region' : ['North', 'South', 'East', 'West'] * 5,
    'sales' : np.random.randint(100, 500, size=20),
    'Units' : np.random.randint(1, 10, size=20),
    'Revenue' : np.random.randint(1000, 5000, size=20),
    'Rep' : ['John', 'Jane', 'Doe', 'Smith'] * 5
}

df = pd.DataFrame(data)
df['Month'] = df['date'].dt.month_name()
df['Quarter'] = 'Q' + df['date'].dt.quarter.astype(str)
df

         date product Region  sales  Units  Revenue    Rep    Month Quarter
0  2023-01-01       A  North    300      5     1834   John  January      Q1
1  2023-01-02       B  South    201      1     4476   Jane  January      Q1
2  2023-01-03       C   East    432      1     3624    Doe  January      Q1
3  2023-01-04       D   West    300      8     3815  Smith  January      Q1
4  2023-01-05       E  North    313      7     4754   John  January      Q1
5  2023-01-06       A  South    381      2     4949   Jane  January      Q1
6  2023-01-07       B   East    292      3     2194    Doe  January      Q1
7  2023-01-08       C   West    260      4     4061  Smith  January      Q1
8  2023-01-09       D  North    317      9     1788   John  January      Q1
9  2023-01-10       E  South    376      7     1168   Jane  January      Q1
10 2023-01-11       A   East    253      3     2090    Doe  January      Q1
11 2023-01-12       B   West    167      4     3336  Smith  January      Q1
12 2023-01-13       C  North    345      2     3231   John  January      Q1
13 2023-01-14       D  South    383      1     2890   Jane  January      Q1
14 2023-01-15       E   East    366      1     4032    Doe  January      Q1
15 2023-01-16       A   West    111      2     4655  Smith  January      Q1
16 2023-01-17       B  North    178      2     1231   John  January      Q1
17 2023-01-18       C  South    254      9     3262   Jane  January      Q1
18 2023-01-19       D   East    495      8     3764    Doe  January      Q1
19 2023-01-20       E   West    249      7     2908  Smith  January      Q1

In [4]:
#pivot table is used to summarize the data by grouping it by one or more columns and performing aggregation on the grouped data
#df for pivot table should be in long format
#values is the column on which we want to perform aggregation, index is the column on which we want to group the data, columns is the column on which we want to pivot the data 
pd.pivot_table(df, values='sales', index='Region', columns='product')

product      A      B      C      D      E
Region
East     253.0  292.0  432.0  495.0  366.0
North    300.0  178.0  345.0  317.0  313.0
South    381.0  201.0  254.0  383.0  376.0
West     111.0  167.0  260.0  300.0  249.0

In [5]:
#to perform multiple aggregations on a column we can use the aggfunc parameter
pd.pivot_table(df, values='Revenue', index='Month', columns='Quarter', aggfunc='sum')

Quarter     Q1
Month
January  64062

In [ ]:
#to perform multiple aggregations on a column we can pass a list of functions to the aggfunc parameter
pivot_table2 = pd.pivot_table(df, values='sales', index='Region', columns='product', aggfunc=['sum', 'mean'])
pivot_table2

         sum                       mean
product    A    B    C    D    E      A      B      C      D      E
Region
East     253  292  432  495  366  253.0  292.0  432.0  495.0  366.0
North    300  178  345  317  313  300.0  178.0  345.0  317.0  313.0
South    381  201  254  383  376  381.0  201.0  254.0  383.0  376.0
West     111  167  260  300  249  111.0  167.0  260.0  300.0  249.0

In [10]:
#to create a pivot table without performing any aggregation we can use the crosstab function
pd.crosstab(df['Region'], df['product'])

product  A  B  C  D  E
Region
East     1  1  1  1  1
North    1  1  1  1  1
South    1  1  1  1  1
West     1  1  1  1  1